# Configure taps (channels)
tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "teamookla/speedtest"

# Brew (packages)
cask "osxfuse"
brew "bash"
brew "bash-completion"
brew "gcc"
brew "cdo"
brew "cmake"
brew "coreutils"
brew "cpanminus"
brew "ffmpeg"
brew "fftw"
brew "gh"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "imagemagick"
brew "llvm"
brew "node"
brew "perl"
brew "pinentry-mac"
brew "rename"
brew "sshfs"
brew "tmux"
brew "tree"
brew "wget"
brew "teamookla/speedtest/speedtest"

# Casks (GUIs)
cask_args appdir: "~/Applications"

cask "adoptopenjdk11-jre"
cask "appcleaner"
cask "dropbox"
cask "gimp"
cask "mactex"
cask "macvim"
cask "mattermost"
cask "panoply"
cask "processing"
cask "texmaker"
# cask "tigervnc-viewer"
# cask "vmware-horizon-client"
cask "xquartz"
