# Configure taps (channels)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "adoptopenjdk/openjdk"

# Brew (packages)
brew "bash"
brew "bash-completion"
brew "cmake"
brew "coreutils"
brew "gcc"
brew "git"
brew "gnupg"
brew "gnu-sed"
brew "imagemagick"
brew "pinentry-mac"
brew "rename"
brew "sshfs"
brew "tmux"
brew "tree"

# Casks (GUIs)
cask_args appdir: "~/Applications"

cask "adoptopenjdk11-jre"
cask "macvim"
cask "mactex"
cask "osxfuse"
cask "panoply"
cask "texmaker"
cask "tigervnc-viewer"
cask "vmware-horizon-client"
cask "xquartz"

# Mac App Store
brew "mas"

mas "Microsoft OneNote", id: 784801555
mas "Sim Daltonism", id: 693112260
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
